export const CATEGORIES = [
	{
		title: 'Minecraft',
		slug: 'minecraft',
		description:
			'Погрузитесь в бескрайний мир творчества и приключений в Minecraft! Эта категория посвящена самой популярной песочнице, где вы можете строить, исследовать и выживать в уникальных мирах. Следите за стримами, вдохновляйтесь креативными постройками, участвуйте в совместных проектах и делитесь своими достижениями. Присоединяйтесь к сообществу, где фантазия не знает границ, и откройте для себя безумные возможности, которые предлагает Minecraft!',
		thumbnailUrl: '/categories/minecraft.webp'
	},
	{
		title: 'Grand Theft Auto V',
		slug: 'grand-theft-auto-v',
		description:
			'Добро пожаловать в криминальный мир Лос-Сантоса! Эта категория посвящена одной из самых популярных игр в открытом мире, где вы можете свободно исследовать, выполнять миссии и наслаждаться безумными приключениями. Следите за стримами, участвуйте в захватывающих гонках и ограблениях, обсуждайте стратегии и делитесь своими уникальными моментами из игры. Присоединяйтесь к сообществу, где каждый найдет себе занятие — от уличных гонок до создания собственных историй в рамках GTA V!',
		thumbnailUrl: '/categories/grand-theft-auto-v.webp'
	},
	{
		title: 'Rust',
		slug: 'rust',
		description:
			'Добро пожаловать в суровый и захватывающий мир Rust! Эта категория посвящена одной из самых популярных игр на выживание, где стратегии и навыки играют ключевую роль. Следите за стримами, наблюдайте за построением баз, захватывающими боями и захватами ресурсов. Делитесь своими тактиками, обсуждайте обновления и находите единомышленников, готовых бросить вызов этому жестокому миру. Присоединяйтесь к нам, чтобы научиться выживать и процветать в условиях жестокой конкуренции!',
		thumbnailUrl: '/categories/rust.webp'
	},
	{
		title: 'Cyberpunk 2077',
		slug: 'cyberpunk-2077',
		description:
			'Добро пожаловать в мрачный и захватывающий мир Night City! Эта категория посвящена Cyberpunk 2077, где вы сможете погрузиться в атмосферу будущего, полного технологий, приключений и сложных выборов. Следите за стримами, обсуждайте квесты и сюжетные линии, а также делитесь своими тактиками и опытом в этой уникальной RPG. Присоединяйтесь к сообществу, где каждый может исследовать мир киберпанка и раскрывать его тайны, становясь частью этой невероятной истории!',
		thumbnailUrl: '/categories/cyberpunk-2077.webp'
	},
	{
		title: 'Общение',
		slug: 'just-chatting',
		description:
			'Погружайтесь в мир живых дискуссий и общения! Эта категория предлагает вам уникальную возможность обмениваться мнениями, участвовать в увлекательных беседах и находить единомышленников. Делитесь своими мыслями, задавайте вопросы и получайте ответы в реальном времени. Присоединяйтесь к стримам, где каждый может высказать свое мнение и стать частью дружелюбного сообщества!',
		thumbnailUrl: '/categories/just-chatting.webp'
	},
	{
		title: 'Red Dead Redemption 2',
		slug: 'red-dead-redemption-2',
		description:
			'Погрузитесь в атмосферу Дикого Запада с одним из самых захватывающих приключений в истории игр! Эта категория посвящена Red Dead Redemption 2, где вы сможете следить за эпическими историями, исследовать живописные ландшафты и участвовать в увлекательных стримах. Обсуждайте стратегии, делитесь моментами из игры и находите единомышленников, разделяющих вашу страсть к этому культовому произведению. Присоединяйтесь к нам и откройте для себя мир, полный приключений, свободы и духа ковбойской жизни!',
		thumbnailUrl: '/categories/red-dead-redemption-2.webp'
	},
	{
		title: 'Обучение',
		slug: 'learning',
		description:
			'Расширьте свои знания и навыки в этой категории, посвященной обучению! Здесь вы найдете стримы и курсы по разнообразным темам — от искусства и музыки до языков и личной продуктивности. Участвуйте в интерактивных уроках, задавайте вопросы и получайте советы от опытных наставников. Обучение стало еще более доступным и увлекательным! Присоединяйтесь к сообществу стремящихся к самосовершенствованию и откройте новые горизонты для своего развития!',
		thumbnailUrl: '/categories/learning.webp'
	},
	{
		title: 'Fortnite',
		slug: 'fortnite',
		description:
			'Погрузитесь в яркий и динамичный мир Fortnite! Эта категория посвящена культовой игре, где строительство, стратегия и сражения с противниками сочетаются в одном захватывающем процессе. Следите за стримами, наблюдайте за матчами с участием лучших игроков и учитесь у них уникальным тактикам. Делитесь своими достижениями, обсуждайте новые обновления и находите единомышленников для совместной игры. Присоединяйтесь к нашему сообществу и станьте частью эпических сражений на острове Fortnite!',
		thumbnailUrl: '/categories/fortnite.webp'
	},
	{
		title: 'Counter-Strike',
		slug: 'counter-strike',
		description:
			'Добро пожаловать в мир напряженных сражений и стратегического геймплея! Эта категория посвящена популярной игре Counter-Strike, где вы сможете наблюдать захватывающие матчи, учиться у лучших игроков и делиться своими тактиками. Присоединяйтесь к стримам, обсуждайте последние обновления и соревнуйтесь с другими игроками. Будьте в курсе самых ярких моментов и станьте частью увлекательной киберспортивной культуры!',
		thumbnailUrl: '/categories/counter-strike.webp'
	},
	{
		title: 'Программирование',
		slug: 'programming',
		description:
			'Откройте для себя увлекательный мир кода и технологий! Эта категория посвящена программированию, где вы можете учиться, делиться опытом и вдохновляться новыми идеями. Следите за стримами, посвященными различным языкам программирования, инструментам и разработке проектов. Участвуйте в обсуждениях, задавайте вопросы и получайте советы от опытных разработчиков. Присоединяйтесь к сообществу, где код становится искусством, и каждая строчка — шаг к вашему следующему достижению!',
		thumbnailUrl: '/categories/programming.webp'
	},
	{
		title: 'Dota 2',
		slug: 'dota-2',
		description:
			'Погрузитесь в мир стратегических сражений и командной игры с Dota 2! Эта категория предназначена для всех поклонников культовой MOBA, где вы сможете следить за увлекательными матчами, изучать стратегии и делиться опытом с другими игроками. Присоединяйтесь к стримам, обсуждайте последние обновления и тактики, а также находите единомышленников для совместной игры. Откройте для себя захватывающий мир героев, навыков и командных сражений, где каждое решение может изменить ход битвы!',
		thumbnailUrl: '/categories/dota-2.webp'
	},
	{
		title: 'Brawl Stars',
		slug: 'brawl-stars',
		description:
			'Погрузитесь в динамичные сражения и быструю тактику в мире Brawl Stars! Эта категория создана для всех фанатов увлекательных битв 3 на 3 и эпических боев в режиме "Королевская битва". Здесь вы сможете смотреть лучшие стримы, обсуждать стратегии и разрабатывать новые тактики для своих бойцов. Присоединяйтесь к сообществу игроков, следите за последними обновлениями, открывайте новых персонажей и прокачивайте их способности. Каждый бой — это новый вызов, где командная работа и мастерство определяют победителя!',
		thumbnailUrl: '/categories/brawl-stars.webp'
	},
	{
		title: 'Clash Royale',
		slug: 'clash-royale',
		description:
			'Погрузитесь в захватывающий мир Clash Royale, где стратегия и мгновенные решения определяют исход сражений! Эта категория предназначена для всех поклонников карточных баталий, где вы сможете наблюдать за увлекательными турнирами, изучать успешные колоды и делиться опытом с другими игроками. Присоединяйтесь к стримам, обсуждайте последние обновления и тактики, открывайте новые карты и улучшайте свои любимые карты до максимума. Исследуйте бесконечные возможности для создания уникальных стратегий и сражайтесь с противниками, чтобы стать мастером арены!',
		thumbnailUrl: '/categories/clash-royale.webp'
	},
	{
		title: 'Музыка',
		slug: 'music',
		description:
			'Погрузитесь в мир музыки, где каждый аккорд и ритм наполняют атмосферу вдохновением и эмоциями! Эта категория предназначена для всех меломанов и музыкантов, где вы сможете наслаждаться живыми выступлениями, открывать новые жанры и делиться своим опытом с единомышленниками. Присоединяйтесь к стримам, обсуждайте последние релизы и события музыкальной индустрии, а также делитесь своими творениями и играми. Откройте для себя удивительный мир звуков, где каждое выступление — это уникальная история, которая ждет своего слушателя!',
		thumbnailUrl: '/categories/music.webp'
	},
	{
		title: 'Call of Duty',
		slug: 'call-of-duty',
		description:
			'Погрузитесь в мир захватывающих военных операций и командных сражений с Call of Duty! Эта категория создана для всех фанатов легендарной франшизы, где вы сможете наблюдать за напряжёнными матчами, изучать тактики и делиться своим опытом с другими игроками. Присоединяйтесь к стримам, обсуждайте последние обновления и новшества, а также находите союзников для совместной игры в различных режимах. Исследуйте динамичные карты, осваивайте уникальное оружие и тактики, где каждое ваше решение может стать ключом к победе в этом эпическом боевом мире!',
		thumbnailUrl: '/categories/call-of-duty.webp'
	},
	{
		title: 'World of Tanks',
		slug: 'world-of-tanks',
		description:
			'Погрузитесь в мир бронированных сражений и стратегической тактики с World of Tanks! Эта категория предназначена для всех поклонников легендарной танковой битвы, где вы сможете наблюдать за захватывающими матчами, изучать особенности различных танков и делиться опытом с единомышленниками. Присоединяйтесь к стримам, обсуждайте последние обновления и балансировку, а также находите товарищей по команде для совместной игры в различных режимах. Откройте для себя увлекательные сражения на разнообразных картах, прокачивайте свою армию и развивайте стратегические навыки, где каждое ваше решение может изменить ход боя!',
		thumbnailUrl: '/categories/world-of-tanks.webp'
	},
	{
		title: 'League of Legends',
		slug: 'league-of-legends',
		description:
			'Погрузитесь в мир эпических сражений и стратегического геймплея с League of Legends! Эта категория создана для всех поклонников культовой MOBA, где вы сможете следить за захватывающими матчами, изучать стратегии и делиться опытом с другими игроками. Присоединяйтесь к стримам, обсуждайте последние обновления и патчи, а также находите единомышленников для совместной игры. Откройте для себя множество уникальных чемпионов, исследуйте их способности и развивайте свои навыки, чтобы стать мастером поля боя. Каждая игра — это новый вызов, где командная работа и умение адаптироваться к ситуации определяют победу!',
		thumbnailUrl: '/categories/league-of-legends.webp'
	},
	{
		title: 'Спорт',
		slug: 'sport',
		description:
			'Погрузитесь в захватывающий мир спорта, где страсть, соревнование и дух командной игры сливаются воедино! Эта категория предназначена для всех поклонников активного образа жизни и спортивных событий, где вы сможете следить за увлекательными матчами, обсуждать стратегии команд и делиться своим опытом с другими фанатами. Присоединяйтесь к стримам, следите за последними новостями и результатами, а также находите единомышленников для совместных тренировок и обсуждений. Откройте для себя удивительный мир спорта, где каждое соревнование — это возможность проявить свои силы и стремление к победе!',
		thumbnailUrl: '/categories/sport.webp'
	}
]
